# GetCircuitPath Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..GetCircuitPath Method
ElectricalSystem Class See Also
---
Gets the list of the electrical system circuit path node position.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<XYZ> GetCircuitPath()
```

Visual Basic
---
```text
Public Function GetCircuitPath As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetCircuitPath()
```

# ### Return Value
The list of the electrical system circuit path node position.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace